src/InformationRegisters/ПараметрыГрафикаПогашенияДолгов/ПараметрыГрафикаПогашенияДолгов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыГрафикаПогашенияДолгов</name>
  <resources>
    <name>ДатаВозникновенияДолга</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЕдиноразовойКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЕжемесячнойКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособПогашения</name>
    <type>
      <types>EnumRef.СпособыПогашенияКредита</types>
    </type>
  </resources>
  <resources>
    <name>СрокМесяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПлановаяДатаПогашения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДнейВГоду</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДеньМесяцаДляРасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗакрытияДолга</name>
    <comment>С этой даты отменяются все плановые операции</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеПересчитыватьПриРедактировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонОперации</name>
    <type>
      <types>DocumentRef.МыВернулиДолг</types>
      <types>DocumentRef.НамВернулиДолг</types>
      <types>DocumentRef.УниверсальнаяОперация</types>
    </type>
  </resources>
  <resources>
    <name>КошелекДляПогашения</name>
    <type>
      <types>CatalogRef.КошелькиИСчета</types>
    </type>
  </resources>
  <resources>
    <name>ФинансоваяЦель</name>
    <type>
      <types>CatalogRef.ФинансовыеЦели</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДляУчетаПроцентов</name>
    <type>
      <types>CatalogRef.СтатьиРасходов</types>
      <types>CatalogRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяЕдиноразовойКомиссии</name>
    <type>
      <types>CatalogRef.СтатьиРасходов</types>
      <types>CatalogRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяЕжемесячнойКомиссии</name>
    <type>
      <types>CatalogRef.СтатьиРасходов</types>
      <types>CatalogRef.СтатьиДоходов</types>
    </type>
  </resources>
  <dimensions>
    <name>Долг</name>
    <type>
      <types>CatalogRef.Долги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПараметрыГрафикаПогашенияДолгов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Обработчик удаления документа, проверяющий использование ссылки в ресурсах регистра
//
//Параметры:
//	Ссылка - документ, который нужно проверить
//	Отказ - Булево - будет установлен в Истина, если удаление невозможно
//
Процедура ПередУдалениемШаблонаОперации(Ссылка, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШаблонОперации", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыГрафикаПогашенияДолгов.*
	|ИЗ
	|	РегистрСведений.ПараметрыГрафикаПогашенияДолгов КАК ПараметрыГрафикаПогашенияДолгов
	|ГДЕ
	|	ПараметрыГрафикаПогашенияДолгов.ШаблонОперации = &ШаблонОперации";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗаписьРегистра = РегистрыСведений.ПараметрыГрафикаПогашенияДолгов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьРегистра, Выборка, , "ШаблонОперации");
		ЗаписьРегистра.Записать(Истина);
		
	КонецЦикла;
	
	
КонецПроцедуры

// Обработчик удаления справочника, проверяющий использование ссылки в ресурсах регистра
//
//Параметры:
//	Ссылка - документ, который нужно проверить
//	Отказ - Булево - будет установлен в Истина, если удаление невозможно
//
Процедура ПередУдалениемСправочника(Ссылка, Отказ) Экспорт
	
	ТипСсылки = ТипЗнч(Ссылка);
	Если Не Метаданные.РегистрыСведений.ПараметрыГрафикаПогашенияДолгов.Ресурсы.КошелекДляПогашения.Тип.СодержитТип(ТипСсылки)
		И Не Метаданные.РегистрыСведений.ПараметрыГрафикаПогашенияДолгов.Ресурсы.ФинансоваяЦель.Тип.СодержитТип(ТипСсылки)
		И Не Метаданные.РегистрыСведений.ПараметрыГрафикаПогашенияДолгов.Ресурсы.СтатьяДляУчетаПроцентов.Тип.СодержитТип(ТипСсылки)
		И Не Метаданные.РегистрыСведений.ПараметрыГрафикаПогашенияДолгов.Ресурсы.СтатьяЕдиноразовойКомиссии.Тип.СодержитТип(ТипСсылки)
		И Не Метаданные.РегистрыСведений.ПараметрыГрафикаПогашенияДолгов.Ресурсы.СтатьяЕжемесячнойКомиссии.Тип.СодержитТип(ТипСсылки)
		Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СсылкаСправочника", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыГрафикаПогашенияДолгов.*
	|ИЗ
	|	РегистрСведений.ПараметрыГрафикаПогашенияДолгов КАК ПараметрыГрафикаПогашенияДолгов
	|ГДЕ
	|	ПараметрыГрафикаПогашенияДолгов.КошелекДляПогашения = &СсылкаСправочника
	|		ИЛИ ПараметрыГрафикаПогашенияДолгов.ФинансоваяЦель = &СсылкаСправочника
	|		ИЛИ ПараметрыГрафикаПогашенияДолгов.СтатьяДляУчетаПроцентов = &СсылкаСправочника
	|		ИЛИ ПараметрыГрафикаПогашенияДолгов.СтатьяЕдиноразовойКомиссии = &СсылкаСправочника
	|		ИЛИ ПараметрыГрафикаПогашенияДолгов.СтатьяЕжемесячнойКомиссии = &СсылкаСправочника
	|";
	
	ИменаРесурсов = Новый Структура("КошелекДляПогашения,ФинансоваяЦель,СтатьяДляУчетаПроцентов,СтатьяЕдиноразовойКомиссии,СтатьяЕжемесячнойКомиссии");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗаписьРегистра = РегистрыСведений.ПараметрыГрафикаПогашенияДолгов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьРегистра, Выборка);
		Для каждого КлючИЗначение Из ИменаРесурсов Цикл
			Если ЗаписьРегистра[КлючИЗначение.Ключ] = Ссылка Тогда
				ЗаписьРегистра[КлючИЗначение.Ключ] = Неопределено;
			КонецЕсли;
		КонецЦикла;
		
		ЗаписьРегистра.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
